[
{
"date": {
"$date": 1628302342000
},
"title": "Misinformation",
"rating": 4,
"review": "I enjoy the game play but it’s untrue that you play against your own skill level and I check each match and have proof. Sometimes I play against others who are 5 times my skill level and sometimes I play against others who are so much lower on the skillz level than I am, I feel bad when I win. At first I thought it was just the practice games but it’s the same when you play money games. I know that you take a gamble whenever you’re playing for money but I think they should stand by their word of playing against your own skill level and that’s not the case. But it’s a gambling platform, I just don’t appreciate the false advertising, call it like it is! And their so called algorithm platform is not realistic and I have my best friend who is a Statistician and Mathematician and she just laughs at their algorithm and refuses to join the app. You asked and offered and I tell it like it is but customer service is awesome as they follow up on requests immediately and are friendly and polite and that’s a nice change but unless you’re playing with money don’t expect to win many tickets, it’s 2 per practice game.",
"isEdited": false,
"userName": "Jrbbn"
},
{
"date": {
"$date": 1616583468000
},
"title": "Correct Review! NOT A SCAM",
"rating": 5,
"review": "Updated review. I previously gave this 3 star but am now updating to 5. The game is addicting, and while I am still convinced there are some unfair components to the game (sometimes you get matched with people who have way more experience than you - so basically you’re very unlikely to win), it is NOT a Scam! I received my first check from them a week ago. Withdrawing an amount that is more than what you deposited takes a long time. Altogether, the entire process was about 2 months long. During these 1-2 months, I was so nervous and skeptical that it would never arrive. It took 2 weeks for them to verify my account, another 2 weeks to process my withdrawal, and then lastly another 3 weeks for the check to arrive in my mailbox. I have since made a second withdrawal and this time my withdrawal was processed in 2 weeks without requesting verification again, so the process is shorter after the first time. Additionally, I was offered an opportunity to sign up for direct deposit, so I am expecting the second withdrawal at a much faster rate. I am officially making money off this game (a sum much larger than I deposited and would have ever expected from a game). I Look forward to using this app in the future for more spending money, but beware it does get addicting and can easily eat up all the time In your day!",
"isEdited": false,
"userName": "Ibashli"
},
{
"date": {
"$date": 1612926530000
},
"title": "Won’t payout",
"rating": 3,
"review": "I started using this app last week and have had more fun than I expected - it’s quite addicting actually. I’ve been practicing using their “Z’s”, which you can earn free and play with for free. I wanted to get real good before starting to play with real money.\n\nHowever, last night I had an issue with the app freezing up and then giving me a bogus WIFI error message at the end of the game, after it showed my score, and was pending the next screen where it shows if I won or lost against my opponent. My wifi connection was great, even though this app said it wasn’t working - I checked on another app of theirs and there was no WIFI issue there, so it was obviously a bug on this BINGO app. I contacted them right away, screenshots attached to show that it was pending and that the other persons score was lower than mine had been. They didn’t respond until after the game “timed out” and marked me as “aborting” the game. I have spoke with several Skillz support people throughout the day, and although they happily credited me my pay-in amount, they refuse to pay my winnings, or give me credit for the league standings, experience points, etc. \n\nIf they won’t give me my earned winnings on a free game, you better believe they wouldn’t do it with real cash games. So sketch. I love this game, but won’t be giving them a penny. I’ll find another BINGO app to give my money to.",
"isEdited": false,
"userName": "AnotherAnnoyedMom"
},
{
"date": {
"$date": 1607646221000
},
"title": "Fun way to play bingo!",
"rating": 5,
"review": "This is a neat way to play Bingo!  The faster you daub, the more credit you get.  I like the practice feature of this app.  Of course you can play for money, if you don’t mind making a deposit. You can win trophies for playing. The challenge is to not daub the wrong number.  You will be penalized.  The people at Skilz are all for player happiness. I have played enough for a Skillz sticker.  And because my address was entered incompletely, they sent me two stickers. How cool is that?! I am still having such a great time playing bingo this what way. I played so much I am developing a raw  area on my right wrist. It challenges me to move faster which is good. One issue I have with the game itself is waiting for my opponents score. There seems to be some lag here and I have to wait or just choose to move on to another game. But I keep coming back. So I guess I’m having a good time.\n\nI keep coming back\n\nAlthough the app itself seems to put a big dent in my battery usage, I still enjoy the bingo.  The number display is quite large. So, due to a vison impairment, I have an easy time reading them, although the font style does cause confusion between 6’s and 8’s.    It’s not enough to deter me.  BINGO on!",
"isEdited": false,
"userName": "Nota happy farmer"
},
{
"date": {
"$date": 1625872165000
},
"title": "Fraud!!! DO NOT USE THIS APP! Disgusting, unethical and illegal!!!",
"rating": 1,
"review": "I made a couple deposits a month ago with my card, BIG MISTAKE! This company not only illegally and without my approval charged the same card over 48 more times but for an amount totaling almost $3,000. I contacted their “support team” and the responses I’ve received are comical at this point….I couldn’t have been more clear with them and they all respond with the same copied responses that have absolutely nothing to do with the 48 unauthorized charges. I’ve went back and forth over 100 times in emails with an extremely thorough and basically dumbed down explanation because obviously they are not comprehending that somehow my card was used another 48 freaking times after I made 5 small deposits last month. To date I’ve contacted their CEO, Founder, several others with higher titles at the company Skillz and yet no one will respond or address. I’ve filled a complaint with the BBB, FTC and my local gaming commission. The amount of these charges are so high and just wrong to do to someone next step is my attorney. DO NOT USE THIS APP OR THIS UNETHICAL, ILLEGAL, THIEVING and downright disgusting company SKILLZ. Unless you want your information taken and used for unauthorized fraudulent transactions. No matter what it takes or what I have to do I am not stopping until they are brought to justice and refund the money that was stolen from me and probably several others.",
"isEdited": false,
"userName": "Browndog7829"
},
{
"date": {
"$date": 1606250494000
},
"title": "Entertaining   To and For events to complete take that longthe",
"rating": 5,
"review": "Playing with real money keeps it interesting and the fact that you can play with no money as well makes it easier on beginners like myself. I have started playing for real money though and at first I felt like I was just barely breaking even but I started spending a little more money to play in events and to play in the brackets and I’ve won a few hundred already and have a check coming in the mail for my winnings I cashed out. I like that you can keep some of your winnings in the app and only have to cash out what you want to that way you still have money to play with. So far I have quite a few of the other SKillz games on my phone and I absolutely love playing all of them but this game in particular is my favorite. It has lots of other people playing at all times so it doesn’t long for events and matches to finalize so that your account can be credited for your winnings. Give it a try but practice before you play any cash games because you’d be surprised at how good some people are and might lose your money if your not prepared for a challenge. All in all I highly recommend this app",
"isEdited": false,
"userName": "pangea916"
},
{
"date": {
"$date": 1615221576000
},
"title": "Fun but SLOW",
"rating": 3,
"review": "First of all, yeah, this is gambling, and there’s no transparency involved, which is sketchy. You have to trust that you’re playing against other real people and that the game is matching you up fairly. If that’s a problem, avoid. \n\nI toss in a few bucks here and there and manage to play for quite some time on it. Haven’t won big enough to bother cashing out yet; I consider the small amount I’ve deposited to be along the lines of paying for a game I enjoy. Fair enough.\n\nHowever, the tiered tournaments often move excruciatingly slowly. You have 24 hours to come back and play your next match each time you move up a tier, so one slow player can stretch out the game for DAYS, and no one can get their prizes until the whole thing’s over. I get that people have to be given a fair amount of time to come back and play, but there has to be a better way. Maybe cut the return time from 24 hours to 12? Today is March 8 and I’ve been stuck on round 4 of a $3 Blackout Battle waiting for an opponent since the 6th, and of course I can’t start another $3 tournament until I place in the current one. It’s too much waiting and dawdling for a $3 game. Seems counterintuitive to make players sit around and wait when they might otherwise throw in a little more money.",
"isEdited": false,
"userName": "Eleanor1224"
},
{
"date": {
"$date": 1610156951000
},
"title": "You gotta check this out",
"rating": 5,
"review": "I could go on for an hour about this company and the games. It is unlike anything I have ever had the pleasure of participating in.  PLEASE, check it out. You have nothing to loose. It s fair, because your matched with another player with the same skill level.  There are many games to choose from so you kind find what interests you personally.  You can play for money, but you don’t have too. But it sure is fun when you win !!!!! 😃.  Trust me when I say this game site is not like any other. I have won multiple times.  But I also don’t always play for money.  There are GREAT prizes you can  obtain by redeeming your tickets.  Through these tough times we are all going through, check it out. It has brought joy to me, and it will to you as well. You will not be disappointed. Great player support staff and always willing to help the player with any questions or concerns. THANK YOU to ALL of the SKILLZ staff for your creation and having a game site that cares about their players.  I’m in for life. Keep up the great work your doing!!!!!\nSincerely, Pamela Trammell",
"isEdited": false,
"userName": "carolinagal61"
},
{
"date": {
"$date": 1622119879000
},
"title": "If you bored this is the game for you",
"rating": 4,
"review": "I love bingo but this Game takes it to a whole new levelI f you have nothing to do this is the game for you becauseYou can spin hours on and have fun every tournament and the prices are great to the music is really cool different game boards in the time and gives you is really fun and the characters to even the game announcer voice is very soothing again get this game download it you won’tRegret it Five⭐️⭐️⭐️⭐️⭐️ ((Update)) my last Boards have been so bad only getting two numbers out of 20 numbers on the board I feel there’s a problem and this is happened more times than I can count and the announcer is calling numbers that aren’t even on my board except for maybe two The last game I played it glitched at the very end but the counter was still counting down with no problem what the heck If this continues I will uninstall and delete this app i’m very disappointed☹️👎🏾👎🏾👎🏾👎🏾?? ((Update 2)) so far so good the game play is a lot smoother will keep updates coming.",
"isEdited": false,
"userName": "serenasheri"
},
{
"date": {
"$date": 1595062565000
},
"title": "Just for fun only! Don’t expect anything",
"rating": 2,
"review": "This apps is just a game for fun! If you are thinking you can win big amount of money, NO! this app is not the right one for you. I’ve tried many times to win at least $5 but it didn’t happen. If you are going to deposit the minimum amount which is $2 you can win atleast once in which is less than $1. Usually you win 60 cents because if you will play for $1 they will not give you the $1 dollar but 60 cents only because the 40 cents it will split into two for Blitz and Developer. I tried to deposit again $2 then $10 it sooo imposible to win evem just $5. I notice when I review the video of me and the opponent, we have the same card but they gave us different bingo number. Most of the time my opponent can fill the card bingo faster than I! Why? because they gave bingo numbers to them which is they have in their card. Most of the time i just got lower points even i tried to click faster 😔😢😢😢. I notice also some of my opponents always pending, it took how many hours before they finish the game. This is scam!!! but if you are looking an apps just to play and have fun Blitz is for you I’m sure you will enjoy every game without spending any penny.",
"isEdited": false,
"userName": "Gracie_924"
},
{
"date": {
"$date": 1608562349000
},
"title": "Play with caution",
"rating": 1,
"review": "Many reviews state that this game is addicting. And, they’re right! It is. But be careful, this game is very good at screwing you over without you noticing... I’m still very skeptical of how truthful they are in stating that you’re playing other members, as you only seem to win when you go extensive periods of time without playing; and even then, you never seem “allowed” to win more than three or four times in a row before hitting a convenient losing streak shortly after. And even then the losses are almost always by crazy-small margins (I really lost by 10 points- several times in a row- once) And when you do win, they aren’t consistent in distributing the correct amount of money you are supposed to win. \nFor example: if I play a match for $1 in winnings, and win that match, sometimes I win the whole pot ($1) sometimes I only win the amount I put towards the game (60¢), sometimes it’s just the amount my opponent put towards the game (40¢). In the end, sometimes they cheat you out of your honesty-won money. So definitely play at your own risk and pay attention to your pot every time you play, especially if you win a match. Remember how much you had before you played the match so you can do the math afterwards if you win.",
"isEdited": false,
"userName": "D_mon!3"
},
{
"date": {
"$date": 1626605219000
},
"title": "Please read before my review before playing",
"rating": 5,
"review": "After  playing 50 or so games I have determined this game to be a Rigged/scam and before you scroll past this review please take the time to read over why I have stated this. \nThe first match you dive into doesn’t offer any assistance or tutorial on how to play and boost your points so you screwed until you figure out how, but even if you figure out how to boost your points it won’t make a difference because even if you get 7 bingos all across the board other players still get more points than you’ll . I deposited $10 because of a promo the game offered which was deposit $10 get an additional $15 so 25 in total. I played the 60 cent games because any of the higher bets I would absolutely lose no matter if I blacked out the entire board.(which is unfair) this game is a complete money grab if I’ve ever seen one but if you still don’t believe anything you’ve just read try the game for yourself and watch your money dwindle away.",
"isEdited": false,
"userName": "GarbageasstrashBitch"
},
{
"date": {
"$date": 1600803905000
},
"title": "Extreme Cheating!!!",
"rating": 1,
"review": "Do NOT download this game unless you just want to play for fun. I would win most of my games with ease while I played for fun. Decided to try for money and that’s when it starts. Sometimes you can win, but since the game keeps a huge chunk of the “buy in” between the players, you have to win much more than you lose just to gain anything at all. When I first started for money I could win about 50% of the time. I’d get my balance up a little bit and then lose 5 or 6 games in a town. Put more money in and they take it extremely fast now. I can black out a card and my opponent will beat me by 2 or 3 points every single time! You’re playing against a computer first of all, so that explains that part. Now it won’t even match me up with anyone, just says finding an opponent, and by the time I finish, my opponent is already done somehow and I always lose. DONT WASTE YOUR TIME OR MONEY ON THIS GAME!\n\nUpdate: tried playing again.....same results!! Somehow I lose by just a couple of points every single time! Weird thing is, every speed daub is 150, every bingo and time bonus is by the 100’s so how do I keep getting these odd numbers and lose by a couple points??? RIGGED!!",
"isEdited": false,
"userName": "BryBry102682"
},
{
"date": {
"$date": 1599271819000
},
"title": "Do not download this game",
"rating": 1,
"review": "This game is a scam you should not download it it’s the most you can do for us if you spend a penny on this it won’t even give you a dollar I will give you aboutFive dollars it’s almost impossible I recommend not even to download this game if you do you’re going to suffer the consequences this is a game for fun and activity but if you were thinking this game would be oh I’m going to win so much money well to fake this game or not give you so much money if you even spend a penny you basically rip you off so I recommend not even spending a dime or a penny on this because this is just a waste of money so if you already have this game I recommend deleting it because it’s not a fun game if you wanted to win tons of money but if you are a fun activity person this be the right game for you just saying if you are the person that wants to win and win everything and win money win money with money this is not the game free I recommend not getting this one if you are not the person who does not want to win money like I said again this is a great app it’s just not the person app who wants to win money thank you for reading my report please take my advice🤞👍",
"isEdited": false,
"userName": "617899"
},
{
"date": {
"$date": 1605033085000
},
"title": "Love It but...",
"rating": 4,
"review": "So this game can be addictive. You can win several games in a row then suddenly have a looong losing streak so be mindful any money you deposit can go really fast. I’ve learned to take a break after several wins to prevent me from losing money too quickly. My only real complaint is that you can add a banking card or paypal to deposit money but when it comes time to withdraw any money you have won you can’t withdraw it to the same card or your paypal that you used to deposit money in the first place. they send you a check instead?? In an age where everything is electronic and online cause its faster you lose customers because of this minor flaw. its a pain to wait for a check then go to a bank to deposit it especially when you need the money quickly. its almost as if they want to keep the money you deposit and the money you win cause they know you dont want to go through alot of trouble to take the money back out of the app.",
"isEdited": false,
"userName": "Bludva"
},
{
"date": {
"$date": 1615615797000
},
"title": "Bonus cash is the worst",
"rating": 3,
"review": "I played this game and got to black tier. It was addicting and I lost more money than when I gambled in Vegas. I played many games during Christmas to get $100 bonus cash. Well, you forfeit bonus cash when you withdraw and any winnings you make don’t deduct from the bonus cash. I don’t understand the point of having a ticket and bonus cash system. Obviously it’s for skillz to make more money off us but I just felt a certain way about it. \nAlso, I would check my challenger when I had a blackout bingo with a super high score, I’d always lose to someone that was level 100 and rank in the top 100. It just didn’t seem like they were real (it will not always show you the recording of the game to see how the other player beat you) and they were not within the realm of my league. The top players have been the top players since I started playing in November. I cracked the top 500 I think but that got me bonus tickets only. I really wanted to make just a little extra cash but I’ve lost a couple hundred. Oh well.",
"isEdited": false,
"userName": "Nomad1Lion"
},
{
"date": {
"$date": 1601490638000
},
"title": "Addictive but feels rigged",
"rating": 3,
"review": "If you want to play just for fun it’s great but money wise it’s kinda messed up that at times you don’t win your full price not even the 60 cents. I have taken a pics of my balance and when I win it’s not the 60 cent you’re supposed to get.  Also I noticed if you won like 2 or 3 times next thing you know when you play you hardly get any number on your card or you feel one or 2 line colors it won’t give you different numbers. It will keep giving you numbers from that color line which you already bingoed it so there is no number to use any more. For example I did a bingo on my purple line and green line it it will keep giving me purple color numbers or green which you can’t use because you finished it all. I have played a whole 50 seconds without a different color number but the same one which makes me kinda annoyed. I have money in here but once I lose it all I’m not depositing again. It is fun so just play without money and if you want the challenge I suggest only do it once in a while",
"isEdited": false,
"userName": "mel& rell"
},
{
"date": {
"$date": 1584500302000
},
"title": "Pretty Darn Fun",
"rating": 5,
"review": "I’ve seen several poor reviews for this app. I think it’s because the advertisements for this game are really misleading. Are you going to make $700 from this game? No, probably not. Possible! But the two days I’ve been playing this I’ve earned about $20! This is based on luck and your accuracy and speed. You have the option to gamble real money. You don’t have to though. It’s a pretty charming game. You don’t need to worry about crazy ads popping up every 2 minutes. The matches are super quick too. There are also chances for higher rewards depending on your ranking. There’s all kinds of fun matches. The only con I would probably say is that once in a while the app suddenly kicks you out, but you get your money back if you report a bug to the team. They’ll help you out. Remember though- this game isn’t going to make you wealthy. Good pocket money though! Also it’s addicting. Thanks for coming to my TedTalk.",
"isEdited": false,
"userName": "ItsKianaYo"
},
{
"date": {
"$date": 1622605701000
},
"title": "Not a scam, but not innocent either!",
"rating": 3,
"review": "Everything was going good, and I wasn’t going to write a review either, up until I noticed something really annoying... so you can definitely play for cash and withdraw, however; I noticed after playing for real cash, you have the option to watch the replay of both you and your opponent’s games. This is actually a key feature of the app and it helps especially if you want to see how the other person got a higher score than you. However, after winning the cash rounds after a few times... you get paired with someone who blows you out of the score board and it doesn’t makes sense especially when you both have the same bingo card! What makes it weird is that after the game, the “watch replay” feature is gone!?? Something is real fishy about that. I’m not sure if this app is 100% legit which is why I’m giving it a 3 star. Please, if you want to make it fair for everyone... then keep the “watch replay” button after all games so we know it’s real! That is all",
"isEdited": false,
"userName": "Tbraider"
},
{
"date": {
"$date": 1613228069000
},
"title": "Fun game but....",
"rating": 2,
"review": "I will say this.  The game is fun.  It’s addicting and unique.  Things get super sketchy when you start playing for money.  First of all, the game takes a chunk of your winnings.  I understand it’s a business, but 40% of a dollar is pretty excessive in my opinion.  The game will let you win at first, but after that it becomes nearly impossible.  I just had three consecutive blackouts and lost all three games.  You’re not actually playing an opponent in real time, you’re actually playing someone’s “replay”, so they are able to decide your oppositions score and determine the outcome of the game.  Personally, if I am playing an “opponent” for money, then I’d prefer to see the actual player.  This game gives you very little information aside whether you won or lost.  My recommendation is to not deposit your money, due to the game taking 40% right out of the gate and taking it amongst themselves to decide if you win or lose.  My suggestion is to play for “z”, the in game free currency.  Like I said, the game itself is fun, but I would refrain from putting your hard earned money into it.",
"isEdited": false,
"userName": "simulatedbass"
}
]